In [1]:
import pandas as pd

In [8]:
df1 = pd.DataFrame([[1,2,3],[2,7,3],[6,7,8],[7,7,89]], columns = ["A","B","C"])

In [9]:
df1

   A  B   C
0  1  2   3
1  2  7   3
2  6  7   8
3  7  7  89

In [17]:
df2 = pd.DataFrame([[13,2,36],[26,7,73],[623,7,88],[579,7,989]], columns = ["X","Y","Z"])

In [18]:
df2

     X  Y    Z
0   13  2   36
1   26  7   73
2  623  7   88
3  579  7  989

In [19]:
df3 = pd.merge(df1, df2,right_on="Y", left_on="B")

In [20]:
df3

   A  B   C    X  Y    Z
0  1  2   3   13  2   36
1  2  7   3   26  7   73
2  2  7   3  623  7   88
3  2  7   3  579  7  989
4  6  7   8   26  7   73
5  6  7   8  623  7   88
6  6  7   8  579  7  989
7  7  7  89   26  7   73
8  7  7  89  623  7   88
9  7  7  89  579  7  989